In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
x=['a','b','c','d','e']
x1=['a','b','c','d','f']
y=[1,2,3,4,5]
z={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [7]:
a=pd.Series(data=y,index=x)

In [8]:
b=pd.Series(data=y,index=x1)

In [9]:
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
b

a    1
b    2
c    3
d    4
f    5
dtype: int64

In [11]:
a+b

a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
f    NaN
dtype: float64

In [12]:
a['d']

4

In [13]:
a[:]

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
A=[1,2,3,4]
B=[5,6,7,8]
C=[9,0,1,2]
D=[3,4,5,6]
E=[7,8,9,0]

In [15]:
df=pd.DataFrame([A,B,C,D,E],['A','B','C','D','E'],['a','b','c','d'])

In [16]:
df

   a  b  c  d
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [17]:
df['e']=df['c']+df['d']

In [18]:
df

   a  b  c  d   e
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11
E  7  8  9  0   9

In [19]:
df.drop('E')

   a  b  c  d   e
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11

In [20]:
df

   a  b  c  d   e
A  1  2  3  4   7
B  5  6  7  8  15
C  9  0  1  2   3
D  3  4  5  6  11
E  7  8  9  0   9

In [21]:
df.drop('e',axis=1,inplace=True)

In [22]:
df

   a  b  c  d
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [23]:
df['a'] #accessing coloumn

A    1
B    5
C    9
D    3
E    7
Name: a, dtype: int64

In [24]:
df.loc['A'] #accessing row

a    1
b    2
c    3
d    4
Name: A, dtype: int64

In [25]:
df.loc['A','c'] #accessing a[row][coloumn]

3

In [26]:
df.iloc[2] #accessing row uding index

a    9
b    0
c    1
d    2
Name: C, dtype: int64

In [27]:
df>3 #conditional selection

       a      b      c      d
A  False  False  False   True
B   True   True   True   True
C   True  False  False  False
D  False   True   True   True
E   True   True   True  False

In [28]:
df[(df['a']>3) & (df['c']>1)]

   a  b  c  d
B  5  6  7  8
E  7  8  9  0

In [29]:
df[df['b']>3][['b','c']]

   b  c
B  6  7
D  4  5
E  8  9

In [30]:
#Missing Data

In [36]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan],'d':[3,4,np.nan,np.nan,np.nan]}

In [37]:
df=pd.DataFrame(d)

In [38]:
df

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0
2  3  8.0  2.0  NaN
3  4  9.0  NaN  NaN
4  5  NaN  NaN  NaN

In [48]:
df.dropna(axis=0)

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0

In [49]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [50]:
df.dropna(thresh=2)

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0
2  3  8.0  2.0  NaN
3  4  9.0  NaN  NaN

In [52]:
df.dropna(thresh=3)

   a    b    c    d
0  1  6.0  0.0  3.0
1  2  7.0  1.0  4.0
2  3  8.0  2.0  NaN

In [1]:
#analysing data using groupby

In [2]:
p={'item':['apple','apple','orange','orange','guns','guns'],'days':['mon','tue','wed','thu','fri','sat'],'sales':[100,80,200,100,5,10]}

In [3]:
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thu', 'fri', 'sat'],
 'sales': [100, 80, 200, 100, 5, 10]}

In [39]:
df=pd.DataFrame(p)

In [40]:
df

     item days  sales
0   apple  mon    100
1   apple  tue     80
2  orange  wed    200
3  orange  thu    100
4    guns  fri      5
5    guns  sat     10

In [41]:
 x=df.groupby('item')

In [42]:
x.mean()

        sales
item
apple    90.0
guns      7.5
orange  150.0

In [43]:
x.sum()

        sales
item
apple     180
guns       15
orange    300

In [44]:
x.std()

            sales
item
apple   14.142136
guns     3.535534
orange  70.710678

In [45]:
x.describe()

       sales
       count   mean        std    min     25%    50%     75%    max
item
apple    2.0   90.0  14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0    7.5   3.535534    5.0    6.25    7.5    8.75   10.0
orange   2.0  150.0  70.710678  100.0  125.00  150.0  175.00  200.0

In [46]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000

In [47]:
x1={'a':[1,2,3],'b':[5,6,7]}
y1={'c':[3,4,5],'d':[2,3,6]}

In [48]:
x=pd.DataFrame(x1,index=['p1','p2','p3'])
y=pd.DataFrame(y1,index=['p1','p2','p3'])

In [49]:
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [50]:
y

    c  d
p1  3  2
p2  4  3
p3  5  6

In [51]:
x.join(y)

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6

In [52]:
x=pd.DataFrame(x1,index=['p1','p2','p3'])
y=pd.DataFrame(y1,index=['p1','p4','p5'])

In [53]:
x.join(y,how="left") #join

    a  b    c    d
p1  1  5  3.0  2.0
p2  2  6  NaN  NaN
p3  3  7  NaN  NaN

In [55]:
x.join(y,how="right")

      a    b  c  d
p1  1.0  5.0  3  2
p4  NaN  NaN  4  3
p5  NaN  NaN  5  6

In [56]:
x.join(y,how="inner")

    a  b  c  d
p1  1  5  3  2

In [57]:
x.join(y,how="outer")

      a    b    c    d
p1  1.0  5.0  3.0  2.0
p2  2.0  6.0  NaN  NaN
p3  3.0  7.0  NaN  NaN
p4  NaN  NaN  4.0  3.0
p5  NaN  NaN  5.0  6.0

In [59]:
x1={'a':[1,1,1,1,1],'b':[1,1,1,1,1],'c':[1,1,1,1,1],'d':[1,1,1,1,1],'e':[1,1,1,1,1]}
x2={'e':[2,2,2,2,2],'f':[2,2,2,2,2],'g':[2,2,2,2,2],'h':[2,2,2,2,2],'i':[2,2,2,2,2]}
x3={'a':[3,3,3,3,3],'b':[3,3,3,3,3],'c':[3,3,3,3,3],'d':[3,3,3,3,3],'e':[3,3,3,3,3]}

In [60]:
df1=pd.DataFrame(x1,index=[1,2,3,4,5])
df2=pd.DataFrame(x2,index=[1,2,3,4,5])
df3=pd.DataFrame(x3,index=[5,6,7,8,9])

In [61]:
df1

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1

In [62]:
df2

   e  f  g  h  i
1  2  2  2  2  2
2  2  2  2  2  2
3  2  2  2  2  2
4  2  2  2  2  2
5  2  2  2  2  2

In [63]:
df3

   a  b  c  d  e
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [67]:
pd.concat([df1,df2],axis=1)  #concatenation

   a  b  c  d  e  e  f  g  h  i
1  1  1  1  1  1  2  2  2  2  2
2  1  1  1  1  1  2  2  2  2  2
3  1  1  1  1  1  2  2  2  2  2
4  1  1  1  1  1  2  2  2  2  2
5  1  1  1  1  1  2  2  2  2  2

In [70]:
pd.concat([df1,df3],axis=0)

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [23]:
df1=pd.DataFrame({'key1':[1,2,3],'a':[2,3,4],'key2':[4,5,6]})
df2=pd.DataFrame({'key1':[1,2,3],'c':[1,2,9],'key2':[4,5,6]})

In [24]:
df1

   key1  a  key2
0     1  2     4
1     2  3     5
2     3  4     6

In [25]:
df2

   key1  c  key2
0     1  1     4
1     2  2     5
2     3  9     6

In [26]:
pd.merge(df1,df2,how='inner',on='key1') #merging

   key1  a  key2_x  c  key2_y
0     1  2       4  1       4
1     2  3       5  2       5
2     3  4       6  9       6

In [27]:
pd.merge(df1,df2,how='inner',on=['key1','key2'])

   key1  a  key2  c
0     1  2     4  1
1     2  3     5  2
2     3  4     6  9

In [28]:
#operations

In [29]:
x=pd.DataFrame({'a':[1,2,3,4,5],'b':[20,20,30,40,50]})

In [30]:
x

   a   b
0  1  20
1  2  20
2  3  30
3  4  40
4  5  50

In [31]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
x.columns

Index(['a', 'b'], dtype='object')

In [33]:
x['a'].sum()

15

In [34]:
def inc(x):
    x=x+10
    return x

In [35]:
x['a'].apply(inc)

0    11
1    12
2    13
3    14
4    15
Name: a, dtype: int64

In [40]:
x.sort_values(by='b',ascending=False)

   a   b
4  5  50
3  4  40
2  3  30
0  1  20
1  2  20

In [41]:
x['b'].unique()

array([20, 30, 40, 50], dtype=int64)

In [42]:
x['b'].nunique()

4

In [43]:
x['b'].value_counts()

20    2
40    1
50    1
30    1
Name: b, dtype: int64

In [44]:
x.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False